import React, {useEffect} from 'react';

import './payments-delivery.css';

const PaymentsDelivery = () => {

    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);

    return (
        <div className='payments-info shadow-lg'>
            <h1>Умови доставки та оплати</h1>
            <h3>Оплата</h3>
            <ol type='number'>
                <li>Онлайн оплата. Товар можна оплатити через платіжні системи на сайті.</li>
                <li>На картку. Ви отримаєте повідомлення з номером картки. Після оплати з вами зв'яжеться наш менеджер для
                    підтвердження деталей замовлення.
                </li>
                <li>Накладеним платежем. Покупець оплачує замовлення у відділенні «Нової пошти». Крім суми замовлення
                    покупець також оплачує послуги переказу коштів за тарифами перевізника (20 грн + 2%).
                </li>
            </ol>
            <h3>Доставка</h3>
            <p>Доставка здійснюється за допомогою сервісів «Нової пошти» згідно з тарифами транспортної компанії. З
                переліком відділень можна ознайомитися на сайті перевізника.
                При замовленні від 1300 гривень доставка безкоштовна.</p>
        </div>
    );
};

export default PaymentsDelivery;
